pftbest/msp430_svd/msp430-gcc-support-files/include/msp430fr2155.h
/* eUSCI_B1 Register Offsets */
#define OFS_UCB1CTLW0                    (0x0000)
#define OFS_UCB1CTLW0_L                  OFS_UCB1CTLW0
#define OFS_UCB1CTLW0_H                  OFS_UCB1CTLW0+1
#define OFS_UCB1CTLW1                    (0x0002)
#define OFS_UCB1CTLW1_L                  OFS_UCB1CTLW1
#define OFS_UCB1CTLW1_H                  OFS_UCB1CTLW1+1
#define OFS_UCB1BRW                      (0x0006)
#define OFS_UCB1BRW_L                    OFS_UCB1BRW
#define OFS_UCB1BRW_H                    OFS_UCB1BRW+1
#define OFS_UCB1STATW                    (0x0008)
#define OFS_UCB1STATW_L                  OFS_UCB1STATW
#define OFS_UCB1STATW_H                  OFS_UCB1STATW+1
#define OFS_UCB1TBCNT                    (0x000A)
#define OFS_UCB1TBCNT_L                  OFS_UCB1TBCNT
#define OFS_UCB1TBCNT_H                  OFS_UCB1TBCNT+1
#define OFS_UCB1RXBUF                    (0x000C)
#define OFS_UCB1RXBUF_L                  OFS_UCB1RXBUF
#define OFS_UCB1RXBUF_H                  OFS_UCB1RXBUF+1
#define OFS_UCB1TXBUF                    (0x000E)
#define OFS_UCB1TXBUF_L                  OFS_UCB1TXBUF
#define OFS_UCB1TXBUF_H                  OFS_UCB1TXBUF+1
#define OFS_UCB1I2COA0                   (0x0014)
#define OFS_UCB1I2COA0_L                 OFS_UCB1I2COA0
#define OFS_UCB1I2COA0_H                 OFS_UCB1I2COA0+1
#define OFS_UCB1I2COA1                   (0x0016)
#define OFS_UCB1I2COA1_L                 OFS_UCB1I2COA1
#define OFS_UCB1I2COA1_H                 OFS_UCB1I2COA1+1
#define OFS_UCB1I2COA2                   (0x0018)
#define OFS_UCB1I2COA2_L                 OFS_UCB1I2COA2
#define OFS_UCB1I2COA2_H                 OFS_UCB1I2COA2+1
#define OFS_UCB1I2COA3                   (0x001A)
#define OFS_UCB1I2COA3_L                 OFS_UCB1I2COA3
#define OFS_UCB1I2COA3_H                 OFS_UCB1I2COA3+1
#define OFS_UCB1ADDRX                    (0x001C)
#define OFS_UCB1ADDRX_L                  OFS_UCB1ADDRX
#define OFS_UCB1ADDRX_H                  OFS_UCB1ADDRX+1
#define OFS_UCB1ADDMASK                  (0x001E)
#define OFS_UCB1ADDMASK_L                OFS_UCB1ADDMASK
#define OFS_UCB1ADDMASK_H                OFS_UCB1ADDMASK+1
#define OFS_UCB1I2CSA                    (0x0020)
#define OFS_UCB1I2CSA_L                  OFS_UCB1I2CSA
#define OFS_UCB1I2CSA_H                  OFS_UCB1I2CSA+1
#define OFS_UCB1IE                       (0x002A)
#define OFS_UCB1IE_L                     OFS_UCB1IE
#define OFS_UCB1IE_H                     OFS_UCB1IE+1
#define OFS_UCB1IFG                      (0x002C)
#define OFS_UCB1IFG_L                    OFS_UCB1IFG
#define OFS_UCB1IFG_H                    OFS_UCB1IFG+1
#define OFS_UCB1IV                       (0x002E)
#define OFS_UCB1IV_L                     OFS_UCB1IV
#define OFS_UCB1IV_H                     OFS_UCB1IV+1

/* No control bits available or already defined for another module */

/************************************************************
* TLV Descriptors
************************************************************/

#define __MSP430_HAS_TLV__                    /* Definition to show that Module is available */

#define TLV_CRC_LENGTH         (0x1A01)       /* CRC length of the TLV structure */
#define TLV_CRC_VALUE          (0x1A02)       /* CRC value of the TLV structure */
#define TLV_START              (0x1A08)       /* Start Address of the TLV structure */
#define TLV_END                (0x1AFF)       /* End Address of the TLV structure */
#define TLV_CRC_START          (0x1A04)       /* Start Address of the CRC protected structure */
#define TLV_CRC_END            (0x1A77)       /* End Address of the TLV protected structure */

#define TLV_LDTAG              (0x01)         /* Legacy descriptor (1xx, 2xx, 4xx families) */
#define TLV_PDTAG              (0x02)         /* Peripheral discovery descriptor */
#define TLV_Reserved3          (0x03)         /* Reserved for future use */
#define TLV_Reserved4          (0x04)         /* Reserved for future use */
#define TLV_BLANK              (0x05)         /* Blank descriptor */
#define TLV_Reserved6          (0x06)         /* Reserved for future use */
#define TLV_Reserved7          (0x07)         /* Reserved for future use */
#define TLV_DIERECORD          (0x08)         /* Unique Die Record */
#define TLV_ADCCAL             (0x11)         /* ADC calibration */
#define TLV_ADC12CAL           (0x11)         /* ADC12 calibration */
#define TLV_ADC10CAL           (0x13)         /* ADC10 calibration */
#define TLV_REFCAL             (0x12)         /* REF calibration */
#define TLV_TAGEXT             (0xFE)         /* Tag extender */
#define TLV_TAGEND             (0xFF)         /* Tag End of Table */

/************************************************************
* Interrupt Vectors (offset from 0xFF80 + 0x10 for Password)
************************************************************/

#define PORT4_VECTOR           (22)                     /* 0xFFCE */
#define PORT3_VECTOR           (23)                     /* 0xFFD0 */
#define PORT2_VECTOR           (24)                     /* 0xFFD2 */
#define PORT1_VECTOR           (25)                     /* 0xFFD4 */
#define ECOMP0_ECOMP1_VECTOR   (28)                     /* 0xFFDA */
#define ADC_VECTOR             (29)                     /* 0xFFDC */
#define EUSCI_B1_VECTOR        (30)                     /* 0xFFDE */
#define EUSCI_B0_VECTOR        (31)                     /* 0xFFE0 */
#define EUSCI_A1_VECTOR        (32)                     /* 0xFFE2 */
#define EUSCI_A0_VECTOR        (33)                     /* 0xFFE4 */
#define WDT_VECTOR             (34)                     /* 0xFFE6 */
#define RTC_VECTOR             (35)                     /* 0xFFE8 */
#define TIMER3_B1_VECTOR       (36)                     /* 0xFFEA */
#define TIMER3_B0_VECTOR       (37)                     /* 0xFFEC */
#define TIMER2_B1_VECTOR       (38)                     /* 0xFFEE */
#define TIMER2_B0_VECTOR       (39)                     /* 0xFFF0 */
#define TIMER1_B1_VECTOR       (40)                     /* 0xFFF2 */
#define TIMER1_B0_VECTOR       (41)                     /* 0xFFF4 */
#define TIMER0_B1_VECTOR       (42)                     /* 0xFFF6 */
#define TIMER0_B0_VECTOR       (43)                     /* 0xFFF8 */
#define UNMI_VECTOR            (44)                     /* 0xFFFA */
#define SYSNMI_VECTOR          (45)                     /* 0xFFFC */
#define RESET_VECTOR           ("reset")                /* 0xFFFE Reset (Highest Priority) */


/************************************************************
* Memory Boundary Definitions
************************************************************/

#define TINYRAM_START           0x0006
#define TINYRAM_LENGTH          0x001A
#define BSL0_START              0x1000
#define BSL0_LENGTH             0x0800
#define INFO_START              0x1800
#define INFO_LENGTH             0x0200
#define TLVMEM_START            0x1A00
#define TLVMEM_LENGTH           0x0200
#define BOOTCODE_START          0x1C00
#define BOOTCODE_LENGTH         0x0400
#define RAM_START               0x2000
#define RAM_LENGTH              0x1000
#define FRAM_START              0x8000
#define FRAM_LENGTH             0x8000
#define ROMLIB_START            0xFAC00
#define ROMLIB_LENGTH           0x5000
#define BSL1_START              0xFFC00
#define BSL1_LENGTH             0x0400

/************************************************************
* End of Modules
************************************************************/

#ifdef __cplusplus
}
#endif /* extern "C" */

#ifndef EXCLUDE_LEGACY
#include "legacy.h"
#endif

#endif /* #ifndef __MSP430FR2155 */


